In [1]:
import sqlite3
db = sqlite3.connect('company_db.db')

In [2]:
cursor = db.cursor()
cursor.execute("CREATE TABLE company (ID INT, Name TEXT, Age int, Address TEXT, Salary real)")

In [5]:
query = "INSERT INTO company VALUES(1122, 'Sabit', 25, 'Mirpur,Bangladesh', 30000.00)"
cursor.execute(query)

In [6]:
query = "INSERT INTO company VALUES(1123, 'Sa', 27, 'Mirpur,Bangladesh', 30000.00)"
cursor.execute(query)

In [9]:
query = "SELECT * FROM company"
data = cursor.execute(query)
for i in data:
    print(i)

(1122, 'Sabit', 25, 'Mirpur,Bangladesh', 30000.0)
(1123, 'Sa', 27, 'Mirpur,Bangladesh', 30000.0)

In [11]:
# Insert a row of data
c = db.cursor()
c.execute("INSERT INTO company (ID, Name, Age, Address, Salary) VALUES (3, 'Venkat', 42, 'Chennai', 400000.00)")

c.execute("INSERT INTO company (ID, Name, Age, Address, Salary) VALUES (4, 'Raju', 31, 'Madurai', 400000.00)")

c.execute("INSERT INTO company (ID, Name, Age, Address, Salary) VALUES (5, 'Ankit', 25, 'Bangalore', 800000.00)")

c.execute("INSERT INTO company (ID, Name, Age, Address, Salary) VALUES (6, 'Ravi', 25, 'Bangalore', 800000.00)")

c.execute("INSERT INTO company (ID, Name, Age, Address, Salary) VALUES (7, 'Shivam', 25, 'Bangalore', 800000.00)")

In [12]:
query = "SELECT * FROM company"
data = cursor.execute(query)
for i in data:
    print(i)

(1122, 'Sabit', 25, 'Mirpur,Bangladesh', 30000.0)
(1123, 'Sa', 27, 'Mirpur,Bangladesh', 30000.0)
(3, 'Venkat', 42, 'Chennai', 400000.0)
(4, 'Raju', 31, 'Madurai', 400000.0)
(5, 'Ankit', 25, 'Bangalore', 800000.0)
(6, 'Ravi', 25, 'Bangalore', 800000.0)
(7, 'Shivam', 25, 'Bangalore', 800000.0)

In [13]:
db.commit()

In [14]:
db.close()

In [16]:
db = sqlite3.connect("company_db.db")
c = db.cursor()
query = "SELECT * FROM company WHERE Salary>40000"
data = c.execute(query)
for i in data:
    print(i)

(3, 'Venkat', 42, 'Chennai', 400000.0)
(4, 'Raju', 31, 'Madurai', 400000.0)
(5, 'Ankit', 25, 'Bangalore', 800000.0)
(6, 'Ravi', 25, 'Bangalore', 800000.0)
(7, 'Shivam', 25, 'Bangalore', 800000.0)

In [18]:
query = "SELECT * FROM company WHERE Address='Mirpur,Bangladesh'"
data = c.execute(query)
for i in data:
    print(i)

(1122, 'Sabit', 25, 'Mirpur,Bangladesh', 30000.0)
(1123, 'Sa', 27, 'Mirpur,Bangladesh', 30000.0)

In [23]:
query = "SELECT * FROM company GROUP BY Address"
data = c.execute(query)
for i in data:
    print(i)

(5, 'Ankit', 25, 'Bangalore', 800000.0)
(3, 'Venkat', 42, 'Chennai', 400000.0)
(4, 'Raju', 31, 'Madurai', 400000.0)
(1122, 'Sabit', 25, 'Mirpur,Bangladesh', 30000.0)

In [25]:
query = "SELECT ID,Age FROM company ORDER BY Age"
data = c.execute(query)
for i in data:
    print(i)

(1122, 25)
(5, 25)
(6, 25)
(7, 25)
(1123, 27)
(4, 31)
(3, 42)

In [26]:
query = "SELECT ID,Age FROM company ORDER BY Age DESC"
data = c.execute(query)
for i in data:
    print(i)

(3, 42)
(4, 31)
(1123, 27)
(1122, 25)
(5, 25)
(6, 25)
(7, 25)

In [27]:
# importing sqlite
import sqlite3

#connecting with the database.
db = sqlite3.connect("food_database.db")
c = db.cursor()

# Create table to store food name and their colories
c.execute('CREATE TABLE food(Name text, Calories int)') 

# Insert a row of data
c.execute("INSERT INTO food VALUES ('Mango', 60)")
c.execute("INSERT INTO food VALUES ('Samosa',262)")

In [28]:
data=c.execute("SELECT * FROM food")
for i in data:
    print(i)

('Mango', 60)
('Samosa', 262)

In [29]:
db.commit()

In [31]:
c.execute("DROP TABLE IF EXISTS food")

In [32]:
data=c.execute("SELECT * FROM food")
for i in data:
    print(i)

OperationalError: no such table: food

# Some understandings
Have to commit if Insert, Update, Delete from table.

No commit needed for table creation, table deletion, db creation, db deletion

In [38]:
c.execute("DROP Database IF EXISTS food_database")

OperationalError: near "Databases": syntax error

SQLite does not use the DROP DATABASE statement like many other database management systems do.

It doesn't use the CREATE DATABASE statement either.

If you need to completely remove a database, you will need to delete the database file from the file system.